'use strict';

 for (let i=0; i<1; i++) {
    var  a='1';
    let b='3';
    const l='2';
    console.log(l);
}
console.log(a);
console.log(b);
console.log(l);
// Цикл фор - це глобальна зміна яка доступна у всі частинах коду
// Примітиви var let const є локальними змінними
// Зміна а оголошена на рівні глобальної області відомості оскільки вона піднята на верхній рівень тому доступна за межами циклу
// Змінні B та l мають блочну область видомості тому вони не доступні за межами циклу, хустинг для цих змінних також відбувається але вони недоступні до моменту фактових оголошень
